[
  {
    "title": "Indian Army SSC (Tech) Entry 2026: Apply Online for 67th Course (Men & Women)",
    "url": "https://govtjobsalert.in/indian-army-ssc-tech-entry-2026/",
    "organization": null,
    "importantDates": {
      "lastDate": null
    },
    "applicationFee": {
      "raw": null
    },
    "ageLimit": null,
    "eligibility": [
      "After login, click on ‘Apply Online’ under the Dashboard. A page ‘Officers Selection – Eligibility’ will open.",
      "Enter personal information, communication details, and educational qualification marks strictly as per matriculation and engineering degree certificates."
    ],
    "salary": "Level 10 Pay Matrix.",
    "selectionProcess": [],
    "applyLink": "https://joinindianarmy.nic.in/Index.htm",
    "description": "Indian Army SSC (Tech) Entry 2026: Apply Online for 67th Course (Men & Women) January 3, 2026 by Anamika Kumari Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635103638-0'); }); Indian Army SSC Tech Entry 2026: Guide to 67th Course (Men & Women) – Vacancy, Eligibility & Salary The Indian Army has released notifications for the 67th Short Service Commission (Technical) Men and 67th Short Service Commission (Technical) Women courses commencing in April 2026 at Officers Training Academy (OTA), Gaya. This entry offers a prestigious opportunity for unmarried male and female engineering graduates to serve the nation as Commissioned Officers. Selected candidates will be commissioned as Lieutenants with a starting stipend of ₹56,100 per month. Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635696235-0'); }); Note: There are separate application windows for Men and Women. Women (SSCW(T)-67): 06 Jan 2026 to 04 Feb 2026 Men (SSC(T)-67): 07 Jan 2026 to 05 Feb 2026 Key Highlights about Recruiting Organisation & Recruitment Notification The Indian Army recruits technical graduates through the Short Service Commission (SSC) Tech entry. The selection is based on shortlisting of applications followed by an SSB Interview, without any written exam. It provides a challenging and rewarding career with a commission period of 10 years, extendable up to 14 years. Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635842606-0'); }); Recruiting Organisation: Indian Army Entry Name: Short Service Commission (Technical) Men – SSC(T)-67 Short Service Commission (Technical) Women – SSCW(T)-67 Total Vacancies: Women: 30 Posts Men: To be notified (Refer to official website) Training Duration: 49 Weeks (Oct 2026 to Sep 2027) Rank on Commission: Lieutenant Job Location: All India Course Commencement: October 2026 (Note: Notifications say “April 2026” in header but training duration “Oct 2026 to Sep 2027” –"
  },
  {
    "title": "Indian Navy 10+2 (B.Tech) Cadet Entry Scheme 2026: Apply Online for 44 Vacancies",
    "url": "https://govtjobsalert.in/indian-navy-102-b-tech-cadet-entry-scheme-2026/",
    "organization": null,
    "importantDates": {
      "startDate": null,
      "lastDate": null
    },
    "applicationFee": {
      "raw": null
    },
    "ageLimit": null,
    "eligibility": [
      "Fill in your personal details, educational qualifications, and JEE (Main) 2025 Rank (CRL) accurately."
    ],
    "salary": "Level 10 (Starting Basic Pay ₹56,100).",
    "selectionProcess": [],
    "applyLink": "https://www.joinindiannavy.gov.in/",
    "description": "Indian Navy 10+2 (B.Tech) Cadet Entry Scheme 2026: Apply Online for 44 Vacancies January 2, 2026 by Anamika Kumari Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635103638-0'); }); Indian Navy 10+2 B.Tech Entry 2026 Overview The Indian Navy has invited applications from unmarried men and women candidates for the 10+2 (B.Tech) Cadet Entry Scheme (Permanent Commission) commencing in July 2026. This is a prestigious opportunity for young aspirants who dream of becoming officers in the Indian Navy immediately after completing their 12th standard. Selected candidates will undergo a four-year B.Tech course at the Indian Naval Academy, Ezhimala, Kerala. Upon successful completion, they will be granted a Permanent Commission in the Executive and Technical branches. The online application window opens on 03 January 2026 and closes on 19 January 2026. Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635696235-0'); }); Key Highlights of Indian Navy 10+2 Entry 2026 The 10+2 Cadet Entry Scheme is a direct entry route for engineering aspirants to join the Indian Navy as commissioned officers. It combines high-quality engineering education with military training, fully funded by the government. Recruitment Authority: Indian Navy Scheme Name: 10+2 (B.Tech) Cadet Entry Scheme (Permanent Commission) Course Commencing: July 2026 Total Vacancies: 44 Posts Commission Type: Permanent Commission Training Location: Indian Naval Academy (INA), Ezhimala Application Mode: Online Application Dates: 03 January 2026 to 19 January 2026 Indian Navy 10+2 B.Tech Vacancy 2026 Breakdown The vacancies are for the Executive & Technical Branch. Branch allocation (Engineering & Electrical) will be done at INA. Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635842606-0'); }); BranchVacanciesGender EligibilityExecutive & Technical Branch44Men & Women Note: A maximum of 07 vacancies are reserved for women candida"
  },
  {
    "title": "DRDO CEPTAM 11 Recruitment 2025 for 764 STA-B & Technician-A Posts – Last Date Extended",
    "url": "https://govtjobsalert.in/drdo-ceptam-11-recruitment-2025/",
    "organization": null,
    "importantDates": {
      "lastDate": "Download Notification"
    },
    "applicationFee": {},
    "ageLimit": null,
    "eligibility": [
      "Bachelor’s Degree in Science (B.Sc) OR Diploma in Engineering/Technology/Computer Science/Allied Subjects from a recognized AICTE institute.\n\nNote",
      "Candidates with higher qualifications like B.E./B.Tech/M.Sc/Ph.D etc. are NOT eligible.",
      "10th Class Pass AND ITI Certification in the required trade from a recognized institute.\n\nNote",
      "Candidates with higher qualifications like B.E./B.Tech/Diploma etc. are NOT eligible."
    ],
    "salary": "Level-6 (STA-B) & Level-2 (Tech-A)",
    "selectionProcess": [],
    "applyLink": "https://govtjobsalert.in/indian-army-ssc-tech-entry-2026/",
    "description": "DRDO CEPTAM 11 Recruitment 2025 for 764 STA-B & Technician-A Posts – Last Date Extended January 2, 2026December 3, 2025 by Anamika Kumari Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635103638-0'); }); DRDO CEPTAM 11 Recruitment 2025 Overview The Defence Research & Development Organisation (DRDO) has released the much-awaited CEPTAM-11 Advertisement for the recruitment of Senior Technical Assistant-B (STA-B) and Technician-A (Tech-A) posts. A total of 764 vacancies have been announced under the Defence Research & Development Organisation Technical Cadre (DRTC). This is a golden opportunity for candidates with a Diploma in Engineering, B.Sc, or ITI certification to join India’s premier defence research organization. The online application process starts on 11th December 2025 and closes on 11th January 2026. Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635696235-0'); }); Key Highlights of DRDO CEPTAM 11 Exam Recruitment Board: Centre for Personnel Talent Management (CEPTAM), DRDO Advertisement No.: CEPTAM-11 Post Name: Senior Technical Assistant-B (STA-B) & Technician-A (Tech-A) Total Vacancies: 764 Posts Job Location: All India (Transferable) Pay Scale: Level-6 (STA-B) & Level-2 (Tech-A) Application Mode: Online Last Date to Apply: 11th January 2026 DRDO CEPTAM 11 Vacancy Breakdown The 764 vacancies are divided between two major posts. Post CodePost NameVacanciesPay Matrix1.1Senior Technical Assistant-B (STA-B)561Level-6 (₹35,400 – ₹1,12,400)1.2Technician-A (Tech-A)203Level-2 (₹19,900 – ₹63,200)Total764 STA-B Disciplines: Automobile, Chemical, Civil, Computer Science, Electrical, Electronics, Mechanical, Metallurgy, Physics, Chemistry, etc. Tech-A Trades: Book Binder, Carpenter, CNC Operator, COPA, Electrician, Electronics, Fitter, Machinist, Welder, etc. Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635842606-0'); }); Eligibility Criteria for DRDO CEPTAM 11 Recrui"
  },
  {
    "title": "SBI SO Recruitment 2025 for 1146 Specialist Officer Vacancies | Last Date Extended",
    "url": "https://govtjobsalert.in/sbi-so-recruitment-2025/",
    "organization": null,
    "importantDates": {
      "lastDate": null
    },
    "applicationFee": {
      "raw": null
    },
    "ageLimit": null,
    "eligibility": [
      "Ensure you meet the age and qualification criteria mentioned in the PDF."
    ],
    "salary": "₹4 Lakhs to ₹45 Lakhs per annum (Depending on Post)",
    "selectionProcess": [],
    "applyLink": "https://recruitment.sbi.bank.in/crpd-sco-2025-26-17/apply",
    "description": "SBI SO Recruitment 2025 for 1146 Specialist Officer Vacancies | Last Date Extended January 2, 2026October 28, 2025 by Anamika Kumari Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635103638-0'); }); SBI SO Recruitment 2025: Massive Vacancy for Wealth Management Officers State Bank of India (SBI) has announced a huge recruitment drive for Specialist Cadre Officers (SCO) on a contract basis. This is a fantastic chance for experienced professionals and graduates to work with India’s largest public sector bank. The recruitment is specifically for the Wealth Management Department, offering high-paying roles like Vice President, Assistant Vice President, and Customer Relationship Executives. With a total of 996 (now increased to 1146 vacancy) vacancies and salary packages reaching up to ₹45 Lakhs per annum, this notification is a career-changing moment. The application window is open from 02 December 2025 to 10 January 2026. Read below for full details on eligibility and selection. Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635696235-0'); }); Key Highlights: SBI Specialist Cadre Officer Notification 2025 Recruitment Board: State Bank of India (SBI) Post Names: VP Wealth, AVP Wealth, Customer Relationship Executive Total Vacancies: 1146 Posts Salary (CTC): ₹4 Lakhs to ₹45 Lakhs per annum (Depending on Post) Job Location: All India (Circle-wise) Application Mode: Online Last Date to Apply: 10 January 2026 About State Bank of India (SBI): State Bank of India is a Fortune 500 company and an Indian multinational, public sector banking and financial services statutory body. It is the country’s largest lender and keeps releasing various notifications for Specialist Officers (SO) to handle specific domains like Wealth Management, IT, and Finance, ensuring efficient banking operations across the nation. SBI SO Vacancy 2025 Breakdown SBI has released a total of 996 vacancies across three major posts. Here is the "
  },
  {
    "title": "RRB Ministerial and Isolated Categories Recruitment 2025: Apply Online for 312 Posts (CEN 08/2025)",
    "url": "https://govtjobsalert.in/rrb-ministerial-and-isolated-categories-recruitment-2025/",
    "organization": null,
    "importantDates": {
      "lastDate": null
    },
    "applicationFee": {
      "raw": null
    },
    "ageLimit": null,
    "eligibility": [],
    "salary": "Level 2 to Level 7 (7th Pay Commission)",
    "selectionProcess": [],
    "applyLink": "https://files.railwayexams.com/rrbapply.pdf",
    "description": "RRB Ministerial and Isolated Categories Recruitment 2025: Apply Online for 312 Posts (CEN 08/2025) December 30, 2025December 18, 2025 by Anamika Kumari Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635103638-0'); }); RRB Ministerial and Isolated Categories Recruitment 2025 Notification Released The Railway Recruitment Boards (RRBs) have officially released the notification for RRB Ministerial and Isolated Categories Recruitment 2025 (CEN 08/2025). This is a fantastic opportunity for candidates looking for a stable and high-paying government job in Indian Railways. With a total of 312 vacancies, the board is hiring for various posts like Junior Translator (Hindi), Chief Law Assistant, Lab Assistant, and Staff & Welfare Inspector. Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635696235-0'); }); The online application window opens on 30th December 2025 and closes on 29th January 2026. Selected candidates will enjoy a great salary structure ranging from Pay Level 2 to Level 7 under the 7th CPC. If you have completed your 12th, Graduation, or Post Graduation, read this guide to understand the eligibility, exam pattern, syllabus, and application process for this RRB Isolated Categories Vacancy 2025. Key Highlights of RRB Isolated Categories 2025 Exam The RRB Ministerial and Isolated Categories Recruitment 2025 is conducted by the Ministry of Railways to fill specialized posts across various Railway Zones. This recruitment (CEN 08/2025) offers a secure career path with excellent perks. Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635842606-0'); }); Recruitment Board: Railway Recruitment Boards (RRBs) Exam Name: Ministerial & Isolated Categories (CEN 08/2025) Post Names: Junior Translator, Law Assistant, Welfare Inspector, Lab Assistant Total Vacancies: 312 Posts Job Location: All India (Railway Zones) Salary: Level 2 to Level 7 (7th Pay Commission) Application Mode: Onlin"
  },
  {
    "title": "RRB Group D Recruitment 2026: Apply Online for 22,000+ Vacancies [CEN 09/2025]",
    "url": "https://govtjobsalert.in/rrb-group-d-recruitment-2026/",
    "organization": null,
    "importantDates": {
      "startDate": null,
      "lastDate": "59 hrs)"
    },
    "applicationFee": {
      "raw": null
    },
    "ageLimit": null,
    "eligibility": [],
    "salary": "The in-hand salary is significantly higher due to various allowances.",
    "selectionProcess": [],
    "applyLink": "https://files.railwayexams.com/rrbapply.pdf",
    "description": "RRB Group D Recruitment 2026: Apply Online for 22,000+ Vacancies [CEN 09/2025] December 24, 2025 by Anamika Kumari Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635103638-0'); }); RRB Group D Recruitment 2026: A Great Opportunity for 10th Pass Candidates The Railway Recruitment Boards (RRBs) have released a short indicative notification (CEN No. 09/2025) announcing a massive recruitment drive for Level-1 (Group D) posts. This is a golden chance for candidates looking for stable government employment in the Indian Railways. With approximately 22,000 vacancies announced across various Railway zones, this recruitment promises to be one of the biggest opportunities of the year. The official application window opens on 21st January 2026, offering a secure career path with a starting basic pay of ₹18,000 plus attractive allowances. Read this comprehensive guide to understand the eligibility, salary structure, selection process, and step-by-step application procedure. Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635696235-0'); }); Key Highlights of RRB Group D Notification 2026 Recruiting Organisation: Railway Recruitment Boards (RRBs) Post Name: Various Posts in Level-1 (Group D) Advertisement No: CEN No. 09/2025 Total Vacancies: 22,000 (Approx.) Pay Scale: Level-1 of 7th CPC Pay Matrix (Initial Pay ₹18,000/-) Job Location: All India (Various Railway Zones) Application Mode: Online Application Start Date: 21 January 2026 Last Date to Apply: 20 February 2026 The Railway Recruitment Board (RRB) conducts this exam to select candidates for various technical and non-technical posts in Level 1. Known for its job security and benefits, the Group D post is highly sought after by millions of aspirants. The selection is generally based on a Computer Based Test (CBT) followed by a Physical Efficiency Test (PET), ensuring a fair and transparent recruitment process. RRB Group D Vacancy Breakdown 2026 The indicative n"
  },
  {
    "title": "BARC OCES / DGFS Exam 2025 – Apply Online for Scientific Officer (Group A) Posts",
    "url": "https://govtjobsalert.in/barc-oces-dgfs-exam-2025/",
    "organization": null,
    "importantDates": {
      "lastDate": null,
      "startDate": null
    },
    "applicationFee": {
      "raw": null
    },
    "ageLimit": null,
    "eligibility": [
      "Ensure you meet the age and qualification criteria mentioned in the notification.",
      "Log in and fill in your personal details, academic qualifications, and choice of screening channel."
    ],
    "salary": "Upon successful completion of training, you will be appointed as a Scientific Officer (Level 10) in the 7th CPC Pay Matrix.\n\n\n\nBasic Pay",
    "selectionProcess": [],
    "applyLink": "https://barcocesexam.in/",
    "description": "BARC OCES / DGFS Exam 2025 – Apply Online for Scientific Officer (Group A) Posts December 19, 2025 by Anamika Kumari Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635103638-0'); }); BARC Scientific Officer Recruitment 2025: A Gateway to Nuclear Science Careers Are you an engineering graduate or science postgraduate dreaming of a prestigious career in India’s frontier nuclear technology sector? The Bhabha Atomic Research Centre (BARC) has released the official notification for the OCES-2026 (Orientation Course for Engineering Graduates and Science Postgraduates) and DGFS-2026 (DAE Graduate Fellowship Scheme for Engineering Graduates). This is a golden chance to join the Department of Atomic Energy (DAE) as a Scientific Officer (Group-A). Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635696235-0'); }); This recruitment drive is not just a job offer; it is an invitation to relish challenges in Nuclear Reactors, Accelerators, and Fuel Cycle Technologies. Selected candidates will undergo a rigorous training program (OCES) or a fellowship (DGFS) starting in August 2026. Upon successful completion, you will be appointed as a Scientific Officer with a lucrative salary package and the pride of serving the nation. Read on for the complete details on eligibility, salary structure, selection process, and the direct link to apply online. Key Highlights: BARC OCES / DGFS Recruitment 2025 Recruiting Organisation: Bhabha Atomic Research Centre (BARC) / Department of Atomic Energy (DAE) Post Name: Scientific Officer (Group-A) Training Schemes: OCES-2026 & DGFS-2026 Vacancies: Various (Discipline-wise) Salary (Upon Appointment): Level 10 (Approx. ₹1,35,000/- per month including allowances) Stipend During Training: ₹74,000/- per month Job Location: All India (BARC Units) Application Mode: Online Last Date to Apply: 21 January 2026 About the Organisation: The Bhabha Atomic Research Centre (BARC) is India’s premier nucl"
  },
  {
    "title": "BEL Kotdwara Trainee Engineer / Officer Recruitment 2026: Salary up to ₹40,000",
    "url": "https://govtjobsalert.in/bel-kotdwara-trainee-engineer-officer-recruitment-2026/",
    "organization": null,
    "importantDates": {
      "lastDate": null
    },
    "applicationFee": {
      "raw": "Pay the application fee via SBI Collect (if applicable).\n\nSelect PSU -> Bharat Electronics Limited -> Recruitment of Trainee Engineer-I for BEL-KOT."
    },
    "ageLimit": null,
    "eligibility": [],
    "salary": "₹30,000/- to ₹40,000/- per month + Annual Allowances",
    "selectionProcess": [],
    "applyLink": "https://jobapply.in/bel2026kotdwarateto/",
    "description": "BEL Kotdwara Trainee Engineer / Officer Recruitment 2026: Salary up to ₹40,000 January 6, 2026 by Anamika Kumari Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635103638-0'); }); BEL Kotdwara Recruitment 2026: Excellent Opportunity for Engineers & MBA Grads The BEL Kotdwara Trainee Engineer / Officer Recruitment 2026 notification has been released, presenting a fantastic career opportunity for fresh engineering and finance graduates. Bharat Electronics Limited (BEL), a prestigious Navratna PSU under the Ministry of Defence, is hiring for 51 positions on a temporary basis for its Kotdwara Unit and various project sites across India. If you are looking for Defence Sector Jobs with a handsome salary starting at ₹30,000 per month plus allowances, this is your chance. The recruitment process is fast-tracked with a Walk-in Written Test scheduled for late January. Read on for complete details regarding eligibility, salary structure, and the step-by-step application process. Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635696235-0'); }); Key Highlights about Recruiting Organisation & Recruitment Notification Bharat Electronics Limited (BEL) is a leader in professional electronics in India. This recruitment drive (Advt No. 21001/HR/KOT/REC/2025-26/04) is specifically managed by the Kotdwara Unit in Uttarakhand. However, selected candidates should be prepared for posting at any BEL Project Site across India. The hiring model is unique: candidates must pre-register online to be eligible for the written test. Recruiting Body: Bharat Electronics Limited (BEL) Post Names: Trainee Engineer-I & Trainee Officer-I Total Vacancies: 51 Job Location: Kotdwara (Uttarakhand) & All India Sites Salary: ₹30,000/- to ₹40,000/- per month + Annual Allowances Category: Central Govt Jobs (PSU) Application Mode: Online Pre-Registration Registration Last Date: 15 January 2026 Exam Date: 25 January 2026 BEL Kotdwara Vacancy Breakdow"
  },
  {
    "title": "IIT Jammu Non Teaching Recruitment 2026: Apply Online for 27 High-Paying Vacancies",
    "url": "https://govtjobsalert.in/iit-jammu-non-teaching-recruitment-2026/",
    "organization": "Indian Institute of Technology (IIT) Jammu",
    "importantDates": {
      "startDate": "00 AM)",
      "lastDate": "00 PM)"
    },
    "applicationFee": {
      "raw": "Pay the application fee online via Net Banking/Credit/Debit Card."
    },
    "ageLimit": null,
    "eligibility": [],
    "salary": "Basic Pay ₹29,200 – ₹92,300. Estimated Gross Salary",
    "selectionProcess": [],
    "applyLink": "https://apply.iitjammu.ac.in/#/home",
    "description": "IIT Jammu Non Teaching Recruitment 2026: Apply Online for 27 High-Paying Vacancies January 5, 2026 by Anamika Kumari Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635103638-0'); }); IIT Jammu Recruitment 2026: Excellent Opportunity for Graduates & Professionals The IIT Jammu Non Teaching Recruitment 2026 notification is officially released, presenting a prestigious career opportunity at one of India’s premier technical institutes. Indian Institute of Technology (IIT) Jammu invites online applications from eligible Indian nationals to fill 27 regular vacancies across Group A, B, and C cadres. Positions include Assistant Registrar, Laboratory Officer, Junior Section Officer, and Laboratory Assistant. Selected candidates will be placed in the 7th Pay Commission scales, ranging from Level-5 to Level-10, ensuring an attractive salary package with central government benefits. The online application window is open from 03 January 2026 to 03 February 2026. Read this comprehensive guide for all details regarding eligibility, vacancy breakdown, and the application process. Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635696235-0'); }); Key Highlights: IIT Jammu Non-Teaching Notification 2026 IIT Jammu, an Institute of National Importance, is recruiting for its administrative and technical wings. This is a direct recruitment drive ensuring stable employment with excellent growth prospects in the scenic city of Jammu. Organization: Indian Institute of Technology (IIT) Jammu Recruitment Notification: IIT Jammu/02/2025 Total Vacancies: 27 Posts Post Types: Administrative, Technical, Sports, Fire & Safety Job Location: Jammu, Jammu & Kashmir Application Mode: Online Only Application Dates: 03 January 2026 to 03 February 2026 IIT Jammu Vacancy 2026 Breakdown The total 27 vacancies are distributed among various specialized posts. Check the table below for post-wise details: Advertisement googletag.cmd.push(function"
  },
  {
    "title": "IISER Berhampur Non-Teaching Recruitment 2026: Apply Online for 14 High-Paying Govt Posts",
    "url": "https://govtjobsalert.in/iiser-berhampur-non-teaching-recruitment-2026/",
    "organization": "Indian Institute of Science Education and Research (IISER) Berhampur",
    "importantDates": {},
    "applicationFee": {
      "raw": "Pay the non-refundable application fee of ₹500 (General/OBC). SC/ST/PwD/Women candidates are exempted."
    },
    "ageLimit": null,
    "eligibility": [
      "Download the “IISER Berhampur Recruitment 2026 Notification PDF” from the link below and check your eligibility."
    ],
    "salary": "Basic Pay ₹21,700. Gross salary approx. ₹40,000 per month.",
    "selectionProcess": [],
    "applyLink": "https://iiserbpr.ac.in/opportunity/non-teaching-staff",
    "description": "IISER Berhampur Non-Teaching Recruitment 2026: Apply Online for 14 High-Paying Govt Posts January 5, 2026 by Anamika Kumari Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635103638-0'); }); IISER Berhampur Recruitment 2026: Great Opportunity for 10th/12th/Graduates The IISER Berhampur Non-Teaching Recruitment 2026 notification is officially released, presenting a golden chance for aspirants seeking stable Central Government Jobs in Odisha. The Indian Institute of Science Education and Research (IISER), an Institute of National Importance, is inviting applications for 14 regular vacancies ranging from Group A Officers to Group C Assistants. With salaries strictly adhering to the 7th Pay Commission, selected candidates can earn a starting Basic Pay from Level-3 to Level-12. The online application link will be active from 31 January 2026 to 02 March 2026. Read this detailed guide to understand the eligibility, salary structure, and application process. Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635696235-0'); }); IISER Berhampur Recruitment 2026: Notification Overview The Indian Institute of Science Education and Research Berhampur is a premier autonomous institution under the Ministry of Education. This recruitment drive (Advt. No. NT-01/2025) targets qualified professionals for Administrative, Technical, Engineering, and Medical cadres. Organization: Indian Institute of Science Education and Research (IISER) Berhampur Recruitment Type: Regular / Deputation Total Vacancies: 14 Posts Job Location: Berhampur, Odisha Application Dates: 31 Jan 2026 – 02 Mar 2026 Selection Mode: Written Test / Skill Test / Interview Official Website: iiserbpr.ac.in IISER Berhampur Vacancy 2026 Details The 14 vacancies are distributed across various departments. Below is the post-wise breakdown: Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635842606-0'); }); Post NameGroupPay LevelVacanc"
  },
  {
    "title": "IIITDM Kurnool Non Teaching Recruitment 2026: Apply Online for 16 Vacancies",
    "url": "https://govtjobsalert.in/iiitdm-kurnool-non-teaching-recruitment-2026/",
    "organization": "Indian Institute of Information Technology Design and Manufacturing (IIITDM) Kurnool",
    "importantDates": {
      "lastDate": "00 PM)",
      "startDate": null
    },
    "applicationFee": {
      "raw": "Pay the application fee online (if applicable)."
    },
    "ageLimit": null,
    "eligibility": [
      "Postgraduate degree with at least 55% marks. Desirable",
      "Applications will be shortlisted based on eligibility."
    ],
    "salary": null,
    "selectionProcess": [],
    "applyLink": "https://iiitknt.samarth.edu.in/index.php/site/login",
    "description": "IIITDM Kurnool Non Teaching Recruitment 2026: Apply Online for 16 Vacancies January 5, 2026 by Anamika Kumari Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635103638-0'); }); IIITDM Kurnool Non Teaching Recruitment 2026: Overview The Indian Institute of Information Technology Design and Manufacturing (IIITDM) Kurnool has announced the IIITDM Kurnool Non Teaching Recruitment 2026, offering a fantastic opportunity for eligible Indian nationals to join an Institute of National Importance. The institute is inviting online applications for 16 Non-Teaching posts, including Technical Officer, Assistant Registrar, Junior Superintendent, Junior Technician, and Junior Assistant. This recruitment drive (Advt. No. IIITDMK/NTS/Rectt/01/2025) aims to fill Group A, B, and C vacancies with a lucrative salary structure ranging from Pay Level-03 to Level-10. The online application process starts on 03 January 2026, and candidates must apply before the deadline on 24 January 2026. Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635696235-0'); }); Key Highlights: IIITDM Kurnool Recruitment 2026 Organization: Indian Institute of Information Technology Design and Manufacturing (IIITDM) Kurnool Post Name: Non-Teaching Staff (Group A, B, C) Total Vacancies: 16 Posts Job Location: Kurnool, Andhra Pradesh Application Mode: Online Last Date to Apply: 24 January 2026 (05:00 PM) IIITDM Kurnool Vacancy Breakdown 2026 The recruitment offers 16 vacancies across various departments. Below is the post-wise distribution of vacancies: Post NameGroupPay LevelVacanciesTechnical OfficerALevel-1002Assistant RegistrarALevel-1001Junior Technical SuperintendentBLevel-0602Junior SuperintendentBLevel-0602Staff NurseBLevel-0601Physical Training InstructorBLevel-0601Junior Technician (Computer Centre)CLevel-0301Junior Technician (Mechanical)CLevel-0301Junior Technician (CSE)CLevel-0302Junior Technician (ECE)CLevel-0301Junior AssistantCLevel-0302To"
  },
  {
    "title": "CSIR NML MTS Recruitment 2026: Apply Online for 22 Multi Tasking Staff Vacancies",
    "url": "https://govtjobsalert.in/csir-nml-mts-recruitment-2026/",
    "organization": "CSIR-National Metallurgical Laboratory (NML), Jamshedpur",
    "importantDates": {
      "lastDate": "00 PM)",
      "startDate": "00 AM)"
    },
    "applicationFee": {
      "raw": "Pay the application fee of ₹500/- via SBI Collect. (SC/ST/PwBD/Women/CSIR Employees/Ex-Servicemen are exempted from fee)."
    },
    "ageLimit": null,
    "eligibility": [],
    "salary": "₹18,000 – ₹56,900",
    "selectionProcess": [],
    "applyLink": "https://nml.res.in/permanent-career-lists",
    "description": "CSIR NML MTS Recruitment 2026: Apply Online for 22 Multi Tasking Staff Vacancies January 2, 2026 by Anamika Kumari Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635103638-0'); }); CSIR NML MTS Recruitment 2026 Overview CSIR-National Metallurgical Laboratory (NML), Jamshedpur, a premier R&D organization under the Council of Scientific & Industrial Research (CSIR), has released a recruitment notification (Advt. No. 10/2025) for the post of Multi Tasking Staff (MTS). There are 22 vacancies available for candidates with 10th/Matriculation or ITI qualifications in various trades. This is a fantastic opportunity for candidates seeking a permanent government job with a decent salary package. The online application process begins on 05 January 2026 and closes on 06 February 2026. Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635696235-0'); }); Key Highlights of CSIR NML MTS Bharti 2026 Organization: CSIR-National Metallurgical Laboratory (NML), Jamshedpur Post Name: Multi Tasking Staff (MTS) Total Vacancies: 22 Posts Salary/Pay Scale: Level-1 (₹18,000 – ₹56,900) | Approx. Total Emoluments: ₹36,000/- PM Job Location: Jamshedpur, Jharkhand Application Mode: Online Last Date: 06 February 2026 CSIR NML MTS Vacancy 2026 Breakdown The vacancies are distributed across different trade specializations. Candidates can apply based on their qualifications. Post CodeSpecialization / TradeVacanciesReservationM 01General (Peon, Safaiwala, etc.)14UR:3, EWS:3, OBC:1, ST:7M 02Electrician02UR:1, OBC:1M 03Carpenter01UR:1M 04Fitter01UR:1M 05Plumber01EWS:1M 06AC & Refrigeration01UR:1M 07Computer (COPA)02OBC:1, ST:1Total22 Note: Out of the total posts, reservations for PwBD and Ex-Servicemen are also applicable as per Govt. norms. Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635842606-0'); }); Eligibility Criteria for CSIR NML Recruitment 2026 Candidates must meet the specific educational and ag"
  },
  {
    "title": "THDC Apprentice Recruitment 2026: Apply Offline for 70 Graduate, Diploma & Trade Apprentice Posts",
    "url": "https://govtjobsalert.in/thdc-apprentice-recruitment-2026/",
    "organization": "THDC India Limited (THDCIL)",
    "importantDates": {
      "lastDate": null
    },
    "applicationFee": {},
    "ageLimit": null,
    "eligibility": [],
    "salary": null,
    "selectionProcess": [],
    "applyLink": "https://govtjobsalert.in/indian-army-ssc-tech-entry-2026/",
    "description": "THDC Apprentice Recruitment 2026: Apply Offline for 70 Graduate, Diploma & Trade Apprentice Posts January 1, 2026 by Anamika Kumari Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635103638-0'); }); THDC Apprentice Recruitment 2026 Overview THDC India Limited (THDCIL), a Mini Ratna PSU, has announced recruitment for Apprentice Trainees for the year 2026-27. This recruitment drive aims to fill 70 vacancies across Graduate, Technician (Diploma), and Trade (ITI) Apprentice categories at Rishikesh. Candidates who have completed their B.E./B.Tech, BBA, Diploma, or ITI in relevant trades are eligible to apply. The application process is offline, and the last date to submit the application form is 31 January 2026. Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635696235-0'); }); Key Highlights of THDC Apprentice Bharti 2026 Organization: THDC India Limited (THDCIL) Post Name: Graduate Apprentice, Technician (Diploma) Apprentice, Trade Apprentice Total Vacancies: 70 (40 Graduate/Diploma + 30 Trade) Job Location: Rishikesh, Uttarakhand Application Mode: Offline Last Date: 31 January 2026 THDC Apprentice Vacancy 2026 Breakdown The vacancies are distributed among different disciplines as follows: 1. Graduate & Technician (Diploma) Apprentices (40 Posts) Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635842606-0'); }); Branch / DisciplineGraduate Apprentice SeatsTechnician (Diploma) Apprentice SeatsCivil Engineering0506Mechanical Engineering0404Electrical Engineering0506Computer Science & IT0302BBA01—Electronics / E&C Engineering0202Total2020 2. Trade (ITI) Apprentices (30 Posts) Trade NameVacanciesCOPA (Computer Operator & Programming Assistant)08Stenographer / Secretarial Assistant08Draughtsman (Civil)04Fitter04Electrician04Electronics Mechanic02Total30 Eligibility Criteria for THDC Apprentice 2026 Candidates must fulfill the following eligibility norms: Educational Qualification"
  },
  {
    "title": "NALCO GET Recruitment 2026: Apply Online for 110 Graduate Engineer Trainee Posts via GATE 2025",
    "url": "https://govtjobsalert.in/nalco-get-recruitment-2026/",
    "organization": null,
    "importantDates": {
      "startDate": "00 AM)",
      "lastDate": "00 PM)"
    },
    "applicationFee": {},
    "ageLimit": null,
    "eligibility": [
      "Enter your personal details, educational qualifications, and GATE 2025 details exactly as they appear on your GATE Admit Card."
    ],
    "salary": "Upon successful completion of one year of training, GETs will be absorbed as Assistant Manager at E1 grade. The pay scale will upgrade to ₹60,000 – 3% – ₹1,80,000 with one additional increment.",
    "selectionProcess": [],
    "applyLink": "https://mudira.nalcoindia.co.in/Account/LoginRecruitment.aspx",
    "description": "NALCO GET Recruitment 2026: Apply Online for 110 Graduate Engineer Trainee Posts via GATE 2025 December 31, 2025 by Anamika Kumari Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635103638-0'); }); NALCO GET Recruitment 2026 Overview National Aluminium Company Limited (NALCO) has released a massive recruitment notification for aspiring engineers across India. If you are looking for a prestigious career in a Navratna Central PSU, the NALCO GET Recruitment 2026 is your gateway to success. NALCO is inviting applications for 110 vacancies of Graduate Engineer Trainees (GETs) in Mechanical, Electrical, and Chemical disciplines. This is a golden chance for engineering graduates to secure a high-paying government job with a starting basic pay of ₹40,000 during training, which upgrades significantly upon absorption. The application window opens on 02 January 2026 and closes on 22 January 2026. Don’t miss this opportunity to join one of Asia’s largest integrated Alumina-Aluminium complexes. Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635696235-0'); }); Key Highlights of NALCO Recruitment 2026 National Aluminium Company Limited (NALCO) is a government-owned Navratna CPSE under the Ministry of Mines. Known for its global presence and “people-centric” approach, NALCO offers a robust career path for young engineers. This recruitment is strictly based on GATE 2025 scores, ensuring that meritorious candidates get the best platform to serve the nation. Recruitment Name: NALCO GET Recruitment 2026 Post Name: Graduate Engineer Trainee (GET) Total Vacancies: 110 Posts Salary/Pay Scale: ₹40,000 – ₹1,40,000 (Training) | ₹60,000 – ₹1,80,000 (After Absorption) Job Location: All India (Transferable) / Corporate Office in Odisha Application Mode: Online Application Dates: 02 January 2026 to 22 January 2026 NALCO GET Vacancy 2026 Breakdown The vacancies are distributed among three core engineering disciplines. Below is the d"
  },
  {
    "title": "BEL Ghaziabad Recruitment 2026: Apply for 119 Trainee Engineer & Officer Posts (Walk-in)",
    "url": "https://govtjobsalert.in/bel-ghaziabad-recruitment-2026-trainee-engineer-officer/",
    "organization": "Bharat Electronics Limited (BEL)",
    "importantDates": {
      "startDate": null
    },
    "applicationFee": {
      "raw": "Pay the application fee via SBI Collect (if applicable) and note down the reference number."
    },
    "ageLimit": null,
    "eligibility": [],
    "salary": "₹30,000 to ₹40,000 per month (plus allowances)",
    "selectionProcess": [],
    "applyLink": "https://govtjobsalert.in/indian-army-ssc-tech-entry-2026/",
    "description": "BEL Ghaziabad Recruitment 2026: Apply for 119 Trainee Engineer & Officer Posts (Walk-in) December 30, 2025 by Anamika Kumari Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635103638-0'); }); BEL Ghaziabad Recruitment 2026 for Trainee Engineer & Officer Bharat Electronics Limited (BEL), a Navratna Public Sector Undertaking under the Ministry of Defence, has announced a recruitment drive for the Ghaziabad Unit. The company is inviting applications from eligible Indian Nationals for the posts of Trainee Engineer-I and Trainee Officer-I on a temporary basis. This is an excellent opportunity for fresh engineering graduates and MBA professionals to kickstart their career with a premier PSU. Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635696235-0'); }); The selection will be conducted through a Walk-in Selection process (Pre-registration mandatory) scheduled for 11th January 2026. Interested candidates must complete the pre-registration online between 29th December 2025 and 9th January 2026. With a total of 119 vacancies and a lucrative salary package starting from ₹30,000 per month, this recruitment drive promises a rewarding career start. Key Highlights of BEL Recruitment 2026 Organization: Bharat Electronics Limited (BEL) Post Name: Trainee Engineer-I & Trainee Officer-I Total Vacancies: 119 Job Location: Ghaziabad Unit (Posting anywhere in India) Salary: ₹30,000 to ₹40,000 per month (plus allowances) Selection Process: Written Test Only (Walk-in) Walk-in Date: 11 January 2026 Registration Deadline: 09 January 2026 BEL Trainee Engineer & Officer Vacancy Breakdown 2026 BEL has announced a total of 119 vacancies across various disciplines. Below is the detailed breakdown: Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635842606-0'); }); Post NameDisciplineNo. of VacanciesTrainee Engineer-IElectronics65Mechanical37Electrical08Computer Science06Chemical01Trainee Officer-IFi"
  },
  {
    "title": "BHEL Project Engineer & Supervisor Recruitment 2026: Apply Online for 20 Vacancies",
    "url": "https://govtjobsalert.in/bhel-project-engineer-supervisor-recruitment-2026/",
    "organization": "Bharat Heavy Electricals Limited (BHEL)",
    "importantDates": {
      "lastDate": null,
      "startDate": null
    },
    "applicationFee": {},
    "ageLimit": "Upper age limit is 32 Years.",
    "eligibility": [
      "Minimum 5 Years of post-qualification experience in areas like Control Systems, Embedded Hardware, Railway Signalling, etc.",
      "Minimum 2 Years of post-qualification experience in installation/commissioning of Solar PV systems, Power Plants, or Infrastructure projects.\n\nNote",
      "Applications will be screened based on eligibility criteria."
    ],
    "salary": null,
    "selectionProcess": [],
    "applyLink": "https://sbdapp.bhel.in/FTARecruitment/",
    "description": "BHEL Project Engineer & Supervisor Recruitment 2026: Apply Online for 20 Vacancies December 29, 2025 by Anamika Kumari Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635103638-0'); }); BHEL Recruitment 2026: An Overview of the Opportunity Bharat Heavy Electricals Limited (BHEL), a Maharatna Public Sector Enterprise, has announced a recruitment drive for the Solar Business Division (SBD). The BHEL Project Engineer / Supervisor Recruitment 2026 is looking to engage experienced professionals on a Fixed Tenure Basis for its projects across India. This is a prestigious opportunity for engineering graduates and diploma holders to work with one of India’s largest engineering and manufacturing enterprises. Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635696235-0'); }); The recruitment aims to fill 20 vacancies (revised via Addendum) for the posts of Project Engineers and Project Supervisors. Selected candidates will be posted at locations like Bengaluru, Khavda (Gujarat), and Bikaner (Rajasthan). The position offers a highly attractive consolidated salary package, reaching up to Rs. 1,00,000 per month for Engineers. The online application process has already commenced and will close on 12 January 2026. However, candidates must also submit a hard copy of their application by 19 January 2026. Key Highlights about BHEL Recruitment 2026 Bharat Heavy Electricals Limited (BHEL) caters to core sectors like Power, Defence, and Aerospace. For this specific drive, they are hiring for their Solar Business Division and Train Collision Avoidance System projects. The engagement is temporary for an initial period of two years. Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635842606-0'); }); Organization: Bharat Heavy Electricals Limited (BHEL) Post Names: Project Engineer (FTA) & Project Supervisor (FTA) Total Vacancies: 20 Posts Job Location: Bengaluru, Gujarat, Rajasthan (Project-based)"
  },
  {
    "title": "BEL Trainee & Project Engineer Recruitment 2026: Apply Online for Engineers Vacancy",
    "url": "https://govtjobsalert.in/bel-trainee-project-engineer-recruitment-2026/",
    "organization": null,
    "importantDates": {
      "startDate": null,
      "lastDate": null
    },
    "applicationFee": {
      "raw": null
    },
    "ageLimit": "Upper age limit is 32 Years.",
    "eligibility": [
      "Minimum 02 years of relevant post-qualification industrial experience is mandatory.\n\nNote"
    ],
    "salary": null,
    "selectionProcess": [],
    "applyLink": "https://files.govtjobsalert.in/2025/12/BEL-Trainee-Project-Engineer-Recruitment-2026-Notification.pdf",
    "description": "BEL Trainee & Project Engineer Recruitment 2026: Apply Online for Engineers Vacancy December 29, 2025 by Anamika Kumari Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635103638-0'); }); BEL Trainee & Project Engineer Recruitment 2026 Notification Overview Are you a fresh engineering graduate or an experienced professional looking for a prestigious career in the defence sector? The Bharat Electronics Limited (BEL), a Navratna Company under the Ministry of Defence, has released the BEL Trainee & Project Engineer Recruitment 2026 notification. This is a fantastic opportunity to work with a premier Indian Public Limited Company known for its innovation in Military Radars, Naval Systems, and Electronic Warfare. Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635696235-0'); }); The recruitment drive aims to fill vacancies for Trainee Engineer-I and Project Engineer-I posts at the BEL Navi Mumbai unit. Selected candidates will not only gain exposure to cutting-edge technology but also receive a handsome salary package ranging up to Rs. 55,000 per month, along with other benefits. The application window is currently open and closes on 06 January 2026. If you are looking for a stable and high-paying engineering job in Maharashtra, read on for complete details regarding eligibility, salary, and the selection process. Key Highlights about BEL Recruitment 2026 Bharat Electronics Limited (BEL) is a government-owned aerospace and defence electronics company. For this recruitment cycle, they are inviting applications from eligible Indian nationals for temporary engagement. The selection will be based on a “Pre-Registered Walk-in” model, meaning candidates must register online first and then attend the selection drive. Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635842606-0'); }); Recruitment Board: Bharat Electronics Limited (BEL) Post Name: Trainee Engineer-I & Project Engineer-I "
  },
  {
    "title": "MPPSC State Civil Service Exam 2026: Notification Out for 155 Posts, Apply Online",
    "url": "https://govtjobsalert.in/mppsc-state-civil-service-exam-2026/",
    "organization": null,
    "importantDates": {
      "startDate": null,
      "lastDate": "00 PM)"
    },
    "applicationFee": {
      "raw": null
    },
    "ageLimit": null,
    "eligibility": [
      "Download the PDF from the link below and read the eligibility rules carefully."
    ],
    "salary": "This post typically falls under a lower pay band but still offers a good starting salary in the range of ₹36,200 – ₹1,14,800 (Level 9).",
    "selectionProcess": [],
    "applyLink": "https://mppsc.mp.gov.in/",
    "description": "MPPSC State Civil Service Exam 2026: Notification Out for 155 Posts, Apply Online January 5, 2026January 2, 2026 by Anamika Kumari Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635103638-0'); }); MPPSC State Service Exam 2026: Comprehensive Guide to Vacancies, Salary & Selection Process The MPPSC State Civil Service Exam 2026 official notification has been released by the Madhya Pradesh Public Service Commission (MPPSC), announcing a massive recruitment drive for 155 administrative posts. This is a highly anticipated opportunity for graduates across Madhya Pradesh and India to secure a gazetted officer position in the state government. The recruitment includes prestigious profiles like Deputy District President (Deputy Collector), Deputy Superintendent of Police (DSP), and Commercial Tax Inspector. Selected candidates will be placed under the 7th Pay Commission salary structure, offering financial stability and social status. The online application process begins on 10th January 2026 and closes on 9th February 2026. Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635696235-0'); }); Key Highlights about MPPSC Recruiting Organisation & Notification The Madhya Pradesh Public Service Commission (MPPSC) is the constitutional body responsible for conducting the State Service Exam (Rajya Sewa Pariksha) to recruit Class I and Class II officers for the MP State Government. The 2026 notification (Advertisement No. 29/2025) aims to fill 155 vacancies across departments like General Administration, Home (Police), Revenue, and Women & Child Development. This exam is the gateway to the most powerful bureaucratic positions in the state. Recruiting Organisation: Madhya Pradesh Public Service Commission (MPPSC) Post Names: Deputy Collector, DSP, Naib Tehsildar, Women Empowerment Officer & Others Total Vacancies: 155 Posts Salary/ Pay Scale: Level 10 (₹56,100 – ₹1,77,500), Level 6 to Level 12 varied. Job Location: Madh"
  },
  {
    "title": "PSSSB Clerk Recruitment 2025 for 70 Vacancies | Last Date Extended",
    "url": "https://govtjobsalert.in/psssb-clerk-recruitment-2025/",
    "organization": null,
    "importantDates": {
      "startDate": "26 November 2025",
      "lastDate": null
    },
    "applicationFee": {
      "raw": "Pay the application fee online (Net Banking/Credit/Debit Card/UPI) after 1 day of submitting the application form."
    },
    "ageLimit": null,
    "eligibility": [
      "Part-A (Qualifying)",
      "Objective Type Written Exam based on educational qualification. Candidates must secure at least 40% marks to be considered."
    ],
    "salary": "Level-2.",
    "selectionProcess": [],
    "applyLink": "https://sssb.punjab.gov.in/",
    "description": "PSSSB Clerk Recruitment 2025 for 70 Vacancies | Last Date Extended January 4, 2026December 1, 2025 by Anamika Kumari Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635103638-0'); }); PSSSB Clerk Recruitment 2025: Opportunity for Graduates in Punjab Government The Subordinate Services Selection Board, Punjab (PSSSB) has released Advertisement No. 11/2025 for the recruitment of 70 vacancies for the posts of Clerk and Clerk IT across various departments of the Punjab Government. Eligible candidates are invited to apply online through the official website. Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635696235-0'); }); This recruitment drive is an excellent opportunity for graduates with proficiency in Punjabi and English typing. The online application process starts on 26 November 2025 and will close on 12 January 2026. Candidates are advised to read the notification carefully and submit their applications before the deadline. Key Highlights of PSSSB Advt No. 11/2025 Recruitment Board: Subordinate Services Selection Board, Punjab (PSSSB) Advt. No.: 11/2025 Post Names: Clerk, Clerk IT Total Vacancies: 70 Posts Job Location: Punjab Application Mode: Online Application Start Date: 26 November 2025 Last Date to Apply: 12 January 2026 (05:00 PM) PSSSB Clerk Vacancy Breakdown 2025 The 70 vacancies are distributed as follows: Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635842606-0'); }); Post NameTotal VacanciesClerk69Clerk IT01Total70 (Note: Department-wise and category-wise breakup is detailed in the official notification PDF.) Eligibility Criteria for Clerk Candidates must fulfill the following educational and age criteria as on 01.01.2025: Educational Qualification 1. For Clerk (69 Posts): Bachelor’s Degree: From a recognized University or Institution. Computer Course: Possess at least 120 Hours course with hands-on experience in the use of Personal Computer or Informat"
  },
  {
    "title": "PSSSB Recruitment 2025: Apply Online for 109 Stenotypist Posts (Last Date Extended)",
    "url": "https://govtjobsalert.in/psssb-recruitment-2025-for-109-stenotypist-posts/",
    "organization": null,
    "importantDates": {
      "startDate": "04 December 2025",
      "lastDate": null
    },
    "applicationFee": {
      "raw": "Pay the application fee online (Net Banking/Credit/Debit Card/UPI) after 2 days of submitting the application form."
    },
    "ageLimit": null,
    "eligibility": [
      "The notice clarifies the selection procedure",
      "If merit is equal, the candidate older in age will be preferred. If age is also same, higher percentage in educational qualification will be considered. If that is also tied, higher marks in Matriculation will be the deciding factor."
    ],
    "salary": "₹ 21,700 – ₹ 69,100 (Level-3).",
    "selectionProcess": [],
    "applyLink": "https://sssb.punjab.gov.in/previous-applications/",
    "description": "PSSSB Recruitment 2025: Apply Online for 109 Stenotypist Posts (Last Date Extended) January 4, 2026November 30, 2025 by Anamika Kumari Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635103638-0'); }); PSSSB Stenotypist Recruitment 2025: Last Date Extended to 16th Jan 2026, Check New Selection Process The Subordinate Services Selection Board, Punjab (PSSSB) has released a significant update regarding Advertisement No. 14/2025 for the recruitment of 109 Stenotypist vacancies. The application deadline has been extended, and there are important modifications to the selection process/exam details. Eligible candidates now have more time to apply online through the official website. Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635696235-0'); }); This recruitment drive remains an excellent opportunity for graduates with proficiency in Punjabi Stenography. The online application process which started on 04 December 2025 will now close on 16 January 2026. Candidates are advised to read the corrigendum notice carefully and submit their applications before the new deadline. Key Highlights of PSSSB Advt No. 14/2025 (Updated) Recruitment Board: Subordinate Services Selection Board, Punjab (PSSSB) Advt. No.: 14/2025 Post Name: Stenotypist Total Vacancies: 109 Posts Job Location: Punjab Application Mode: Online Application Start Date: 04 December 2025 Last Date to Apply: 16 January 2026 (Extended) PSSSB Stenotypist Date Extension & Corrigendum Notice PSSSB has issued a corrigendum notice dated 26.12.2025 regarding Advt No. 14/2025. Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635842606-0'); }); Last Date Extended: The last date to apply online has been extended to 16.01.2026, and the last date for fee payment is now 19.01.2026. Selection Process Update: The notice clarifies the selection procedure: Punjabi Language Test: A mandatory qualifying written test of Matriculation level w"
  },
  {
    "title": "PSSSB JE Recruitment 2026: Apply Online for 207 Junior Engineer Posts (Civil/Mech/Elect)",
    "url": "https://govtjobsalert.in/psssb-je-recruitment-2025/",
    "organization": null,
    "importantDates": {
      "startDate": null,
      "lastDate": null
    },
    "applicationFee": {
      "raw": null
    },
    "ageLimit": null,
    "eligibility": [
      "Should possess a 3-Year Diploma in Civil Engineering from a recognized State Technical Education Board/University OR a Degree in Civil Engineering (Higher Qualification).",
      "If marks are equal, the candidate older in age will be placed higher. If age is also same, the candidate with higher percentage in the requisite educational qualification will be preferred.",
      "Upload scanned copies of your Photo, Signature, 10th Certificate (for DOB & Punjabi proof), and Qualification Certificates."
    ],
    "salary": "₹35,400/- (Level-6)",
    "selectionProcess": [],
    "applyLink": "https://sssb.punjab.gov.in/",
    "description": "PSSSB JE Recruitment 2026: Apply Online for 207 Junior Engineer Posts (Civil/Mech/Elect) January 4, 2026December 24, 2025 by Anamika Kumari Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635103638-0'); }); PSSSB JE Recruitment 2026: Vacancies Increased to 207, Last Date Extended to 20th Jan The Subordinate Services Selection Board, Punjab (PSSSB) has released a significant update regarding the recruitment of Junior Engineers (JE). The total number of vacancies has been increased to 207, and the application deadline has been extended. This is a massive opportunity for engineering candidates in Punjab to secure a government job in prestigious departments like the Punjab Water Supply & Sewerage Board and the Water Resources Department. The online application process is currently active and will now close on 20th January 2026. Eligible candidates who missed the earlier deadline must apply immediately. Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635696235-0'); }); Key Highlights of PSSSB JE Notification 2026 Recruiting Organisation: Subordinate Services Selection Board, Punjab (PSSSB) Post Name: Junior Engineer (Civil, Mechanical, Electrical) Advt Nos: 15/2025 & 16/2025 Total Vacancies: 207 Posts (Revised) Pay Scale: ₹35,400/- (Level-6) Job Location: Punjab Application Mode: Online Application Start Date: 22 December 2025 Last Date to Apply: 20 January 2026 (Extended) PSSSB is the primary recruiting body for Group C and Group B posts in the Punjab Government. This recruitment drive aims to fill technical roles crucial for the infrastructure development of the state. PSSSB JE Last Date Extended & Vacancies Increased to 207 The PSSSB has released a Corrigendum Notice (dated 01.01.2026) announcing two major updates. Firstly, the last date to apply online has been extended from 28th December 2025 to 20th January 2026, giving candidates an additional chance to register. Secondly, the Water Resources Departme"
  },
  {
    "title": "BPSSC Adhinayak Lipik Recruitment 2026: Apply Online for 64 Clerk Posts, Salary & Syllabus",
    "url": "https://govtjobsalert.in/bpssc-adhinayak-lipik-recruitment-2026/",
    "organization": null,
    "importantDates": {
      "startDate": null,
      "lastDate": null
    },
    "applicationFee": {
      "raw": "Complete the payment for the application fee first. The system will then generate a Registration ID and Password sent via SMS/Email."
    },
    "ageLimit": null,
    "eligibility": [
      "Candidates must have passed the Intermediate (10+2) examination or an equivalent certificate issued by a recognized board.",
      "The educational qualification must be completed on or before 01.08.2025."
    ],
    "salary": "Upon joining, the gross monthly salary typically ranges between ₹40,000 to ₹45,000 depending on current DA rates.",
    "selectionProcess": [],
    "applyLink": "https://bpssc.bihar.gov.in/",
    "description": "BPSSC Adhinayak Lipik Recruitment 2026: Apply Online for 64 Clerk Posts, Salary & Syllabus January 4, 2026 by Anamika Kumari Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635103638-0'); }); BPSSC Adhinayak Lipik Recruitment 2026: Apply for Bihar Home Guard Clerk Vacancy The Bihar Police Subordinate Services Commission (BPSSC) has officially released the notification (Advt. No. 01/2026) for the recruitment of BPSSC Adhinayak Lipik (Superintendent Clerk). This is a significant update for candidates seeking 12th pass government jobs in Bihar. The commission invites online applications from eligible male, female, and third-gender candidates to fill 64 vacancies in the Bihar Home Guards Service Cadre. Selected candidates will be placed under Pay Level-4, offering a competitive salary and government benefits. The online application process begins on 02 January 2026 and concludes on 02 February 2026. Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635696235-0'); }); This article serves as a comprehensive guide based strictly on the official notification. Below, you will find detailed information on the BPSSC Adhinayak Lipik Syllabus, exam pattern, physical efficiency test (PET) marking scheme, and step-by-step application instructions. If you are preparing for Bihar Police Clerk Recruitment 2026, read every section carefully to ensure your application is accepted. Key Highlights: BPSSC Superintendent Clerk Notification 2026 The recruitment is organized by the BPSSC for the Home Department (Special Branch), Govt of Bihar. The post of Adhinayak Lipik is a clerical position within the Home Guard hierarchy. Candidates must note that the selection differs from typical clerk jobs as it involves a rigorous Physical Efficiency Test (PET) which determines the final merit list. Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635842606-0'); }); Recruitment Authority: Bihar Police Subordi"
  },
  {
    "title": "OSSSC CRE Recruitment 2026: Apply Online for 4668 Vacancies (CRE-I & II)",
    "url": "https://govtjobsalert.in/osssc-cre-recruitment-2026/",
    "organization": null,
    "importantDates": {},
    "applicationFee": {
      "raw": null
    },
    "ageLimit": "5 years for SC/ST/SEBC/Women; 10 years for PwD. (Note",
    "eligibility": [],
    "salary": null,
    "selectionProcess": [],
    "applyLink": "https://osssc.gov.in/Public/OSSSC/Default.aspx",
    "description": "OSSSC CRE Recruitment 2026: Apply Online for 4668 Vacancies (CRE-I & II) January 4, 2026 by Anamika Kumari Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635103638-0'); }); OSSSC Combined Recruitment Exams 2026: Guide to 4668 Vacancies (CRE-I & CRE-II) The Odisha Sub-Ordinate Staff Selection Commission (OSSSC) has released two major notifications for the Combined Recruitment Examinations (CRE) 2025. The recruitment drive now spans a grand total of 4668 vacancies across various district-level posts. Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635696235-0'); }); CRE-I (Advt No. 3219): 3150 Posts (RI, ARI, Amin, JA, ICDS Supervisor, SFS, VAW) CRE-II (Advt No. 3220): 1518 Posts (Forester, Forest Guard, Excise Constable) This is a massive opportunity for candidates with qualifications ranging from 10th Pass (HSC) to Graduation. The online registration and application process for both advertisements runs simultaneously from 07th January 2026 to 07th February 2026. Key Highlights about OSSSC CRE Notifications The OSSSC conducts these exams to select eligible candidates for Group B and Group C posts under various departments like Revenue, Forest, Excise, and Women & Child Development. Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635842606-0'); }); Recruiting Organisation: Odisha Sub-Ordinate Staff Selection Commission (OSSSC) Exam Names: Combined Recruitment Exam (CRE-I & CRE-II) 2025 Total Vacancies: 4668 Posts (3150 + 1518) Job Location: Odisha (District/Division/Circle Cadre) Application Dates: 07th January 2026 to 07th February 2026 Selection Process: Written Test (Common), Practical Skill Test (for CRE-I), Physical Test (for CRE-II). Vacancy Breakdown: Post-wise Distribution The vacancies are distributed across two notifications. Below is the consolidated breakdown: CRE-I Vacancies (Administrative & Revenue Posts) Post NameDepartmentVacanciesRevenue Inspector (RI)R &"
  },
  {
    "title": "Odisha Civil Services Exam 2026: Notification for 465 Vacancies (Group A & B)",
    "url": "https://govtjobsalert.in/odisha-civil-services-exam-2026/",
    "organization": null,
    "importantDates": {
      "startDate": null,
      "lastDate": "00 PM)"
    },
    "applicationFee": {
      "raw": null
    },
    "ageLimit": null,
    "eligibility": [],
    "salary": "Group A",
    "selectionProcess": [],
    "applyLink": "https://opscechayan.in/#/auth/landing",
    "description": "Odisha Civil Services Exam 2026: Notification for 465 Vacancies (Group A & B) January 4, 2026 by Anamika Kumari Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635103638-0'); }); Odisha Civil Services Exam 2026: Complete Guide to 465 Vacancies, Eligibility & Selection The Odisha Public Service Commission (OPSC) has released the notification (Advt. No. 05 of 2025-26) for the Odisha Civil Services Examination (OCSE) 2025. This prestigious examination aims to recruit suitable candidates for Group-A and Group-B services under the Odisha State Government. With a revised total of 465 vacancies (including 154 reserved for women), this recruitment drive offers positions in the Odisha Administrative Service (OAS), Odisha Police Service (OPS), Odisha Revenue Service (ORS), and other allied services. The online registration process commences on 20th January 2026 and the final submission deadline is 27th February 2026. Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635696235-0'); }); Key Highlights about OPSC & Civil Services Notification The Odisha Public Service Commission (OPSC) is the state agency authorized to conduct the Civil Services Examination for entry-level appointments to the various civil services of Odisha. The 2025-26 notification brings opportunities for graduates to join the state administration with attractive salary packages and career growth. Recruiting Organisation: Odisha Public Service Commission (OPSC) Exam Name: Odisha Civil Services Examination (OCSE) 2025 Post Names: OAS, OPS, OFS, ORS, etc. Total Vacancies: 465 Posts (Revised) Salary/ Pay Scale: Group A: Level-12 (₹56,100) Group B: Level-10 (₹44,900) Job Location: Odisha Application Dates: 20th January 2026 to 27th February 2026 Prelims Exam Date: Tentatively 07th June 2026 Vacancy Breakdown: Service-wise Distribution The total 465 vacancies are distributed among various Group-A and Group-B services. The breakdown is as follows: Advert"
  },
  {
    "title": "HSSC Constable Recruitment 2026: Apply Online for 5500 Posts (Male/Female/GRP)",
    "url": "https://govtjobsalert.in/hssc-constable-recruitment-2026/",
    "organization": null,
    "importantDates": {
      "lastDate": "59 PM)"
    },
    "applicationFee": {
      "raw": null
    },
    "ageLimit": null,
    "eligibility": [
      "The candidate must have qualified the Common Eligibility Test (CET) for Group-C.",
      "Enter personal details, educational qualifications, and post preferences (Male GD / GRP)."
    ],
    "salary": "₹21,700 – ₹69,100.",
    "selectionProcess": [],
    "applyLink": "https://hssc.gov.in/",
    "description": "HSSC Constable Recruitment 2026: Apply Online for 5500 Posts (Male/Female/GRP) January 2, 2026 by Anamika Kumari Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635103638-0'); }); HSSC Constable Recruitment 2026: Comprehensive Guide to 5500 Vacancies & Selection Process The Haryana Staff Selection Commission (HSSC) has officially released Advertisement No. 01/2026, announcing a massive recruitment drive for 5500 Constables in the Haryana Police Department. This recruitment is part of CET Phase-II, inviting online applications from CET Group-C qualified candidates for the posts of Male Constable (General Duty), Female Constable (General Duty), and Male Constable (Government Railway Police – GRP). Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635696235-0'); }); This is a golden opportunity for 12th-pass aspirants to join the uniformed services. A major highlight of this notification is the shortlisting of candidates equal to 10 times the number of vacancies for the Knowledge Test, significantly increasing the chances for CET-qualified aspirants. Selected candidates will secure a permanent government job with a starting salary of ₹21,700 (Level-3). The application window is open from 11th January 2026 to 25th January 2026. Key Highlights about HSSC & Police Recruitment Notification The Haryana Staff Selection Commission (HSSC) is the recruiting agency for Group C posts in the state. This drive specifically targets the Haryana Police force. Candidates will be selected based on their performance in the Physical Measurement Test (PMT), Physical Screening Test (PST), and a Knowledge Test. Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635842606-0'); }); Recruiting Organisation: Haryana Staff Selection Commission (HSSC) Post Name: Constable (Male GD, Female GD, Male GRP) Advt. No.: 01/2026 Total Vacancies: 5500 Posts Salary/ Pay Scale: Level 3 (₹21,700 – ₹69,100) Job Location:"
  },
  {
    "title": "MPSC Civil / Forest Service Recruitment 2026: Apply Online for 87 Group A & B Posts",
    "url": "https://govtjobsalert.in/mpsc-civil-forest-service-recruitment-2026/",
    "organization": null,
    "importantDates": {
      "lastDate": null
    },
    "applicationFee": {
      "raw": "Pay the requisite application fee online or via SBI Challan.\n\nOpen Category"
    },
    "ageLimit": null,
    "eligibility": [
      "Candidates must hold a Bachelor’s Degree from a recognized university or an equivalent qualification.",
      "The system will check your eligibility based on your profile. Select the posts/cadres you wish to apply for (e.g., State Service, Vet Service)."
    ],
    "salary": "Pay Level S-15. The salary scale is ₹ 41,800 – ₹ 1,32,300.",
    "selectionProcess": [],
    "applyLink": "https://mpsconline.gov.in/candidate",
    "description": "MPSC Civil / Forest Service Recruitment 2026: Apply Online for 87 Group A & B Posts January 2, 2026 by Anamika Kumari Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635103638-0'); }); MPSC Civil / Forest Service Recruitment 2026: A Golden Gateway to Maharashtra Government Service The Maharashtra Public Service Commission (MPSC) has officially released the notification for the MPSC Civil / Forest Service Recruitment 2026 (Advt. No. 132/2025). This is a premier opportunity for aspirants seeking prestigious Group A and Group B gazetted positions within the Maharashtra State Government. With a total of 87 vacancies announced under the “Maharashtra Gazetted Civil Services Combined Preliminary Examination 2026,” the commission invites eligible candidates to join departments like General Administration and Revenue & Forest. If you dream of an impactful career with excellent job security, lucrative salary, and administrative power, this recruitment drive is your chance to shine. The application window opens on December 31, 2025, and closes on January 20, 2026. Don’t miss this chance to serve the state! Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635696235-0'); }); Key Highlights about MPSC & Recruitment Notification The Maharashtra Public Service Commission (MPSC) is the constitutional body responsible for selecting officers for civil service jobs in the Indian state of Maharashtra. This year’s Combined Preliminary Examination 2026 currently covers posts under the State Service (Rajyaseva) and the Maharashtra Veterinary Service. The preliminary exam is scheduled for 31st May 2026 across 37 district centers in Maharashtra. Recruitment Overview: Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635842606-0'); }); Post Names: Deputy Chief Executive Officer, Assistant Director (Finance), Assistant BDO, Industry Officer, Veterinary Officer. Total Vacancies: 87 Posts. Salary: Rs. 41"
  },
  {
    "title": "DRDO SSPL Apprentice Recruitment 2026: Apply Online for Diploma, Graduate & ITI Posts",
    "url": "https://govtjobsalert.in/drdo-sspl-apprentice-recruitment-2026/",
    "organization": null,
    "importantDates": {
      "startDate": null,
      "lastDate": null
    },
    "applicationFee": {},
    "ageLimit": null,
    "eligibility": [
      "The stipend will be paid strictly as per the Apprentices Act, 1961 and Government of India rules. While the exact amount is not specified in the notification, it generally ranges from ₹7,000 to ₹9,000 per month depending on the qualification level (Graduate/Diploma/ITI).",
      "Applications will be screened based on the eligibility criteria and marks obtained in the qualifying examination."
    ],
    "salary": null,
    "selectionProcess": [],
    "applyLink": "https://govtjobsalert.in/indian-army-ssc-tech-entry-2026/",
    "description": "DRDO SSPL Apprentice Recruitment 2026: Apply Online for Diploma, Graduate & ITI Posts January 4, 2026 by Anamika Kumari Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635103638-0'); }); DRDO SSPL Apprentice Recruitment 2026: Golden Opportunity in Defence Sector The Solid State Physics Laboratory (SSPL), a premier laboratory under the Defence Research and Development Organisation (DRDO), has released an official notification for the engagement of Apprentices for the year 2026. This is a massive opportunity for students who have completed their ITI, Diploma, or Graduation and are looking to kickstart their career with a prestigious government organization. Located in Timarpur, Delhi, SSPL is offering a 12-month training program that provides hands-on experience in cutting-edge defence technology. Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635696235-0'); }); If you have passed your qualifying exam between 2021 and 2025, you are eligible to apply. The recruitment drive aims to fill multiple slots, including 33 specific vacancies for Diploma holders and various positions for ITI and Graduate candidates. The selection will be based on a written test or interview. Read this complete guide to understand the eligibility, stipend, and step-by-step application process. The last date to submit the online application is 15 January 2026. Key Highlights: DRDO SSPL Apprentice Notification 2026 The Solid State Physics Laboratory (SSPL) is renowned for its work in solid-state materials and devices. Joining as an apprentice here adds significant value to your resume. Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635842606-0'); }); Recruiting Body: Solid State Physics Laboratory (SSPL), DRDO Post Names: Graduate, Diploma, and ITI Apprentice Total Vacancies: 33 (Diploma) + Various (ITI/Grad) Stipend: As per Government Apprenticeship Rules Job Location: Timarpur, Delhi Application Mode"
  },
  {
    "title": "IOCL Apprenticeship 2026 Notification for 501 Posts – Apply Online for Northern Region Vacancy",
    "url": "https://govtjobsalert.in/iocl-apprenticeship-2026/",
    "organization": null,
    "importantDates": {
      "startDate": "00 AM)",
      "lastDate": "00 PM)"
    },
    "applicationFee": {
      "raw": null
    },
    "ageLimit": null,
    "eligibility": [
      "Merit List Generation (H4)"
    ],
    "salary": null,
    "selectionProcess": [],
    "applyLink": "https://nats.education.gov.in/student_type.php",
    "description": "IOCL Apprenticeship 2026 Notification for 501 Posts – Apply Online for Northern Region Vacancy December 28, 2025 by Anamika Kumari Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635103638-0'); }); IOCL Apprenticeship 2026: Comprehensive Guide for 501 Northern Region Posts Indian Oil Corporation Limited (IOCL), Marketing Division (Northern Region), has released the official notification for the engagement of Technical and Non-Technical Apprentices for the year 2025-26. This is a massive opportunity for 10th, 12th, ITI, Diploma, and Graduate pass candidates to secure a position in a “Global 500” company. The recruitment drive aims to fill 501 vacancies across various states including Delhi, Haryana, Punjab, Uttar Pradesh, and Rajasthan. The application window is open from 27th December 2025 to 12th January 2026. Selected candidates will receive a monthly stipend as per government norms along with additional allowances. Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635696235-0'); }); Key Highlights about Recruiting Organisation & Recruitment Notification Recruiting Organisation: Indian Oil Corporation Limited (IOCL) – Northern Region (Marketing Division) Post Names: Technician Apprentice, Trade Apprentice (ITI), Graduate Apprentice, Data Entry Operator (DEO) Total Vacancies: 501 Posts Job Location: Northern Region (Delhi, Haryana, Punjab, Chandigarh, HP, J&K, UP, Rajasthan, Uttarakhand) Application Dates: 27 December 2025 to 12 January 2026 Selection Mode: Merit-Based (No Written Exam) Indian Oil Corporation Limited (IOCL) is a Maharatna PSU and one of the largest commercial undertakings in India. This apprenticeship program is part of the Skill Building Initiative for the Nation. Candidates will be engaged for a period of 12 months. There is no written test or interview; selection is purely based on the marks obtained in your qualifying examination (ITI/Diploma/Degree), making it a golden chance for me"
  },
  {
    "title": "SJVN Apprenticeship 2026: Apply Online for 100 Graduate, Diploma & ITI Seats",
    "url": "https://govtjobsalert.in/sjvn-apprenticeship-2026/",
    "organization": null,
    "importantDates": {
      "startDate": null,
      "lastDate": null
    },
    "applicationFee": {
      "raw": "Pay the application fee of ₹100/- online (Debit/Credit Card/Net Banking)."
    },
    "ageLimit": null,
    "eligibility": [
      "Enter your personal details, educational qualifications, and bank details carefully."
    ],
    "salary": null,
    "selectionProcess": [],
    "applyLink": "https://sjvn.nic.in/current-jobs/94",
    "description": "SJVN Apprenticeship 2026: Apply Online for 100 Graduate, Diploma & ITI Seats December 27, 2025 by Anamika Kumari Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635103638-0'); }); SJVN Apprenticeship 2026: Excellent Training Opportunity for HP Youth SJVN Limited, a Mini Ratna Public Sector Undertaking, has released an official notification (Advt. No. 125/2025) for the engagement of 100 Apprentices under the Apprenticeship Act, 1961. This recruitment drive is exclusively for candidates who are domiciles of Himachal Pradesh. The vacancies are available for Graduate, Technician (Diploma), and ITI apprentices in various trades like Civil, Electrical, Mechanical, IT, Electrician, Fitter, etc. Selected candidates will undergo one year of training and receive a monthly stipend of up to ₹15,000. The online application process begins on 26th December 2025 and closes on 15th January 2026. Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635696235-0'); }); Key Highlights of SJVN Apprenticeship Recruitment 2026 Recruiting Organisation: SJVN Limited (A Joint Venture of Govt. of India & Govt. of HP) Post Name: Graduate, Technician (Diploma) & ITI Apprentice Advertisement No: 125/2025 Total Vacancies: 100 Seats Stipend: ₹12,500 – ₹15,000 per month Job Location: Himachal Pradesh (SJVN Projects/Offices) Application Mode: Online Application Start Date: 26 December 2025 Last Date to Apply: 15 January 2026 SJVN is a major power sector player. An apprenticeship here adds significant value to your profile, providing industrial exposure and skill enhancement. SJVN Apprentice Vacancy Breakdown 2026 The 100 training seats are distributed across three categories and various disciplines. Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635842606-0'); }); 1. Graduate Apprentices (Total: 40) Civil: 15 Electrical: 10 Mechanical: 10 Information Technology: 05 2. Technician (Diploma) Apprentices (Total: 2"
  },
  {
    "title": "BHEL Apprentice Recruitment 2025: Apply Online for 50 Graduate & Technician Posts",
    "url": "https://govtjobsalert.in/bhel-apprentice-recruitment-2025/",
    "organization": null,
    "importantDates": {
      "startDate": null,
      "lastDate": null
    },
    "applicationFee": {
      "raw": "There is no application fee for any category."
    },
    "ageLimit": null,
    "eligibility": [],
    "salary": null,
    "selectionProcess": [],
    "applyLink": "https://hwr.bhel.com/recruitment/GdDpAppr/diploma_data_entry.jsp",
    "description": "BHEL Apprentice Recruitment 2025: Apply Online for 50 Graduate & Technician Posts December 25, 2025 by Anamika Kumari Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635103638-0'); }); BHEL Apprentice Recruitment 2025: Golden Opportunity for Engineering Graduates & Diploma Holders Bharat Heavy Electricals Limited (BHEL), Haridwar, has released an official notification for the engagement of Graduate (B.Tech/B.E.) and Technician (Diploma) Apprentices. This recruitment drive aims to fill 50 vacancies across various engineering disciplines like Mechanical, Electrical, and Electronics. This is an excellent opportunity for aspiring engineers to gain valuable industrial training from a ‘Maharatna’ company. Selected candidates will undergo one year of apprenticeship training and will receive a monthly stipend of up to ₹12,300. The online application process begins on 24th December 2025 and closes on 06th January 2026. Eligible candidates must apply online and submit their documents before the deadline. Advertisement googletag.cmd.push(function() { googletag.display('div-gpt-ad-1767635696235-0'); }); Key Highlights of BHEL Haridwar Apprentice Recruitment 2025 Recruiting Organisation: Bharat Heavy Electricals Limited (BHEL), Haridwar Post Name: Graduate & Technician Apprentice Advertisement No: H.R./Recruitment/Grad. Tech. Apprentice/55 Total Vacancies: 50 Stipend: ₹12,300 (Graduate) / ₹10,900 (Technician) Job Location: Haridwar, Uttarakhand Application Mode: Online & Offline (Document Submission) Application Start Date: 24 December 2025 Last Date to Apply Online: 06 January 2026 BHEL is one of India’s largest engineering and manufacturing enterprises. An apprenticeship here provides hands-on experience and enhances employability. The selection is strictly merit-based, ensuring a fair chance for deserving candidates. BHEL Apprentice Vacancy Breakdown 2025 The recruitment is for both Graduate and Technician apprentices in specific branches. Adve"
  }
]